[net]
# Testing
batch=1
subdivisions=1
# Training
#batch=64
#subdivisions=2
width=320
height=320
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 50200
policy=steps
steps=40000,45000
scales=.1,.1

# layer 0
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# layer 1
[maxpool]
size=2
stride=2

# layer 2
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer 3
[maxpool]
size=2
stride=2

# layer 4
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# layer 5
[maxpool]
size=2
stride=2

# layer 6
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# layer 7
[maxpool]
size=2
stride=2

# layer 8
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# layer 9
[maxpool]
size=2
stride=2

# layer 10
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# layer 11
[maxpool]
size=2
stride=1

# layer 12
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

###########

# layer 13
[convolutional]
size=1
stride=1
pad=1
filters=195
activation=linear

[yolo]
mask = 3,4,5
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=60
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -3

# layer 16
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer 17
[upsample]
stride=2

[route]
layers = -1, 8

# layer 19
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# layer 20
[convolutional]
size=1
stride=1
pad=1
filters=195
activation=linear

[yolo]
mask = 0,1,2
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=60
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
